{"class_name": "Model", "keras_version": "1.1.0", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6, 20], "input_dtype": "float32", "name": "input_0"}, "inbound_nodes": [], "name": "input_0"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 6, 20], "input_dtype": "float32", "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 25, 20], "input_dtype": "float32",  "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1, 20], "input_dtype": "float32",  "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 20], "input_dtype": "float32",  "name": "input_4"}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 20], "input_dtype": "float32",  "name": "input_5"}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 20], "input_dtype": "float32", "name": "input_6"}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "Merge", "config": {"name": "merge", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["input_0", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0]]], "name": "merge"}, {"class_name": "Masking", "config": {"trainable": true, "mask_value": 0.0, "name": "masking_23"}, "inbound_nodes": [[["merge", 0, 0]]], "name": "masking_23"}, {"class_name": "LSTM", "config": {"inner_activation": "hard_sigmoid", "trainable": true, "inner_init": "orthogonal", "output_dim": 20, "unroll": false, "consume_less": "cpu", "init": "glorot_uniform", "dropout_U": 0.0, "input_dtype": "float32", "batch_input_shape": [null, null, 20], "input_length": null, "dropout_W": 0.0, "activation": "tanh", "stateful": false, "b_regularizer": null, "U_regularizer": null, "name": "lstm_0", "go_backwards": false, "input_dim": 20, "return_sequences": false, "W_regularizer": null, "forget_bias_init": "one"}, "inbound_nodes": [[["masking_23", 0, 0]]], "name": "lstm_0"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "main_output", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}, "inbound_nodes": [[["lstm_0", 0, 0]]], "name": "main_output"}], "input_layers": [["input_0", 0, 0], ["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0], ["input_5", 0, 0], ["input_6", 0, 0]], "output_layers": [["main_output", 0, 0]], "name": "LSTM"}}
